{"title":"Free Time Journal — Entry 1","date":"Published: January 30, 2021","description":"Shows I'm watching, Projects I'm working on, etc.","slug":"free-time-journal-1","html":"\n<p>This month has been a whirlwind for me. Starting my career in software has invigorated me to hone my skills and become a more well-rounded developer.</p>\n<p>I have thrown myself into a few frontend projects, but this personal site was the first that I've seen through. I was attracted to <a href=\"https://svelte.dev/\">Svelte</a>\nby some videos I found through\nYouTube (thank you <a href=\"https://www.youtube.com/watch?v=xgER1OutVvU\">Ben Awad</a>) and flew through the provided tutorial in just a couple days.</p>\n<p>I decided to embark on a personal site as my first real project. I stood up a couple drafts of this site using vanilla Svelte, just enough to get comfortable with the\nframework. For the final product, my first instinct was to grab a static site generator like <a href=\"https://elderguide.com/tech/elderjs/https://elderguide.com/tech/elderjs/\">Elder.js</a>\n(which also supports SSR) initially, I decided exposing myself to Sapper for routing would be more valuable to me since Svelte's WIP official router, \n<a href=\"https://svelte.dev/blog/whats-the-deal-with-sveltekit\">SvelteKit</a>, is essentially a rewrite of Sapper.</p>\n<p>In the time I haven't spent in front of my computer screeen, I have largely been seated in front of my television's. This month I got my hands on HBO Max (thanks Ma!),\nand I have fallen in love with <em>Silicon Valley</em>. In fact, I only have the series finale left to watch as I write this out. I was initially hooked by the show's\ngoofy depiction of nerd culture in the software industry, but the comedy has been what keeps me clicking on \"Next Episode\".</p>\n<p>I watched <em>Dead to Me</em> with my SO, Tess, on Netflix and we loved the first season. Unfortunately, the second season was lackluster, and we gave up on it after just two\nepisodes. The direction and cinematography fell off a cliff, and we noticed an excessive amount of product placement shoehorned in.</p>\n<p>Netflix, you need to stop cashing out on your series after one decent season. Please.</p>\n<p>I found myself scrambling for any piece of information that could help me ramp up into my new gig. I got my hands on some reading material that has helped me out.\nBeing human, I failed to recognize that my attention span was absolutely nuked by being locked indoors for what has been essentially the past year. As a result, \nI made it through at most ~100 pages into any book I actually started on. Here is the list of what I've been reading lately:</p>\n<ul>\n\t<li class=\"listHeader reading\"><span>Title</span> <span>Author</span> <span>Progress:</span></li>\n\n\t<li class=\"reading\"><span>Clean Code (Reread)</span> <span>Uncle Bob</span> <span>Completed</span></li>\n\t<li class=\"reading\"><span><a href=\"https://www.robmiles.com/c-yellow-book/\">The C# Yellow Book</a></span> <span>Rob Miles</span> <span>Page: 120</span></li>\n\t<li class=\"reading\"><span>Being Geek</span> <span>Michael Lopp</span> <span>Page: 75</span></li>\n</ul>\n<p>And what I've got on deck:</p>\n<ul>\n\t<li class=\"listHeader unread\"><span>Title</span> <span>Author</span></li>\n\n\t<li class=\"unread\"><span>Designing Data Intensive Applications</span> <span>Martin Kleppmann</span></li>\n\t<li class=\"unread\"><span>The Imposter's Handbook</span> <span>Rob Conery</span></li>\n\t<li class=\"unread\"><span>The Hitchhiker's Guide to the Galaxy (Reread)</span> <span>Douglas Adams</span></li>\n\t<li class=\"unread\"><span>Refactoring - Improving the Design of Existing Code</span> <span>Martin Fowler</span></li>\n\t<li class=\"unread\"><span>The Clean Coder</span> <span>Uncle Bob</span></li>\n</ul>\n<p>I'll try to update this on a monthly basis to keep me motivated and accountable. At some point I would like to start creating video dev logs \nto post on YouTube. I also have been getting a lot of game dev videos recommended to me lately and would like to dip my toes in the water there, but that is not a high\npriority for me right now. Thanks for making it to the end!</p>\n\t\t"}